driver-tests/bpelse/assign/AtomicAssign/src/variableCopyTest.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="variableCopyTest" targetNamespace="http://j2ee.netbeans.org/wsdl/variableCopyTest"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/variableCopyTest" xmlns:ns="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/variableCopyTest">
            <xsd:import namespace="http://xml.netbeans.org/schema/dataTypes.xsd" schemaLocation="dataTypes.xsd"/>
        </xsd:schema>
    </types>
    <message name="variableCopyTestOperationRequest">
        <part name="part1" element="ns:helloObj"/>
    </message>
    <message name="variableCopyTestOperationReply">
        <part name="part1" element="ns:helloObj"/>
    </message>
    <portType name="variableCopyTestPortType">
        <wsdl:operation name="variableCopyTestOperation">
            <wsdl:input name="input1" message="tns:variableCopyTestOperationRequest"/>
            <wsdl:output name="output1" message="tns:variableCopyTestOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="variableCopyTestBinding" type="tns:variableCopyTestPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="variableCopyTestOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="variableCopyTestService">
        <wsdl:port name="variableCopyTestPort" binding="tns:variableCopyTestBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/variableCopyTestService/variableCopyTestPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="variableCopyTest1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="variableCopyTestPortTypeRole" portType="tns:variableCopyTestPortType"/>
    </plnk:partnerLinkType>
</definitions>
