driver-tests/bpelse/assign/AssignNamespacesJBI/test/literalQName/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns0:Element20 xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:ns1="http://j2ee.netbeans.org/wsdl/QNameAssignment_WithStructuredPart">ns1:message</ns0:Element20>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
