driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationOnePropjbi/test/results/Inv_PattReq_Pick_InitNo/Actual_20130311144757_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:msgns="Inv_PattReq_Pick_InitNo_Parent_WSDL_TNS">
      <string>Test StringTest StringTest String</string>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>