driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationOnePropjbi/test/EventHandler_InvokeAndReply/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
  <soapenv:Body>
    <dat:helloObj>
      <dat:recursive>
          <dat:recursive>
              <dat:recursive/>
              <dat:string>Invoke_ReqResp</dat:string>
              <dat:int>3</dat:int>
              <!--Zero or more repetitions:-->
              <dat:long>10</dat:long>
              <dat:double>1.051732E7</dat:double>        
          </dat:recursive>       
      </dat:recursive>
      <!--Zero or more repetitions:-->
      <dat:string>?string?</dat:string>
      <!--Zero or more repetitions:-->
      <dat:nonNegativeInteger>?200?</dat:nonNegativeInteger>
      <!--Zero or more repetitions:-->
      <dat:byte>?2?</dat:byte>
      <!--Zero or more repetitions:-->
      <dat:short>?1?</dat:short>
      <!--Zero or more repetitions:-->
      <dat:int>?3?</dat:int>
      <!--Zero or more repetitions:-->
      <dat:long>?10?</dat:long>
      <!--Zero or more repetitions:-->
      <dat:negativeInteger>?-201?</dat:negativeInteger>
      <!--Zero or more repetitions:-->
      <dat:dateTime>?2008-09-28T18:49:45?</dat:dateTime>
      <!--Zero or more repetitions:-->
      <dat:nonPositiveInteger>?-200?</dat:nonPositiveInteger>
      <!--Zero or more repetitions:-->
      <dat:duration>?P1Y2M6DT14H25M13S?</dat:duration>
      <!--Zero or more repetitions:-->
      <dat:ENTITIES>??string??</dat:ENTITIES>
      <!--Zero or more repetitions:-->
      <dat:double>?1.051732E7?</dat:double>
      <!--Zero or more repetitions:-->
      <dat:ENTITY>?string?</dat:ENTITY>
      <!--Zero or more repetitions:-->
      <dat:float>?1.5E2?</dat:float>
      <!--Zero or more repetitions:-->
      <dat:Element30>??string??</dat:Element30>
      <!--Zero or more repetitions:-->
      <dat:integer>?100?</dat:integer>
      <!--Zero or more repetitions:-->
      <dat:decimal>?1000.00?</dat:decimal>
      <!--Zero or more repetitions:-->
      <dat:boolean>?false?</dat:boolean>
      <!--Zero or more repetitions:-->
      <dat:Element2>?string?</dat:Element2>
      <!--Zero or more repetitions:-->
      <dat:Element1>?string?</dat:Element1>
      <!--Zero or more repetitions:-->
      <dat:Element29>?string?</dat:Element29>
      <!--Zero or more repetitions:-->
      <dat:Element28>?string?</dat:Element28>
      <!--Zero or more repetitions:-->
      <dat:Element27>?string?</dat:Element27>
      <!--Zero or more repetitions:-->
      <dat:Element26>?string?</dat:Element26>
      <!--Zero or more repetitions:-->
      <dat:Element25>??string? ?string??</dat:Element25>
      <!--Zero or more repetitions:-->
      <dat:Element24>?string?</dat:Element24>
      <!--Zero or more repetitions:-->
      <dat:Element23>?string?</dat:Element23>
      <!--Zero or more repetitions:-->
      <dat:Element22>?token?</dat:Element22>
      <!--Zero or more repetitions:-->
      <dat:Element20>?qname?</dat:Element20>
      <!--Zero or more repetitions:-->
      <dat:Element19>?http://www.any.com/circum/regemque?</dat:Element19>
      <!--Zero or more repetitions:-->
      <dat:Element18>?bmltYm9ydW0=?</dat:Element18>
      <!--Zero or more repetitions:-->
      <dat:Element17>?6672656D756E74?</dat:Element17>
      <!--Zero or more repetitions:-->
      <dat:Element16>?--09-07:00?</dat:Element16>
      <!--Zero or more repetitions:-->
      <dat:Element15>?---14?</dat:Element15>
      <!--Zero or more repetitions:-->
      <dat:Element14>?--03-18?</dat:Element14>
      <!--Zero or more repetitions:-->
      <dat:Element13>?2018-08:00?</dat:Element13>
      <!--Zero or more repetitions:-->
      <dat:Element12>?2017-11-07:00?</dat:Element12>
      <!--Zero or more repetitions:-->
      <dat:Element11>?2014-06-10-07:00?</dat:Element11>
      <!--Zero or more repetitions:-->
      <dat:Element10>?23:56:46-08:00?</dat:Element10>
    </dat:helloObj>
  </soapenv:Body>
</soapenv:Envelope>